export interface PyeonsongmokMaster {
  code: string;
  name: string;
  seomoks: [string, string][];
}

export function masterFullName(m: PyeonsongmokMaster) { return `${m.code} ${m.name}`; }

export const pyeonsongmokMasterList: PyeonsongmokMaster[] = [
  { code: '101', name: '인건비', seomoks: [['01', '보수'], ['02', '기타직보수'], ['03', '공무직(무기계약)근로자보수'], ['04', '기간제근로자등 보수']] },
  { code: '201', name: '일반운영비', seomoks: [['01', '사무관리비'], ['02', '공공운영비'], ['03', '행사운영비'], ['04', '맞춤형복지제도 시행경비'], ['05', '공립대학운영비']] },
  { code: '202', name: '여비', seomoks: [['01', '국내여비'], ['02', '월액여비'], ['03', '국외업무여비'], ['04', '국제화여비'], ['05', '공무원교육여비']] },
  { code: '203', name: '업무추진비', seomoks: [['01', '기관운영업무추진비'], ['02', '정원가산업무추진비'], ['03', '시책추진업무추진비'], ['04', '부서운영업무추진비']] },
  { code: '204', name: '직무수행경비', seomoks: [['01', '직책급업무수행경비'], ['02', '특정업무경비']] },
  { code: '205', name: '의회비', seomoks: [['01', '의정활동비'], ['02', '월정수당'], ['03', '의원국내여비'], ['04', '의원국외여비'], ['05', '의정운영공통경비'], ['06', '의회운영업무추진비'], ['07', '의원역량개발비(공공위탁,자체교육)'], ['08', '의원역량개발비(민간위탁)'], ['09', '의원정책개발비'], ['10', '의장협의체부담금'], ['11', '의원국민연금부담금'], ['12', '의원국민건강부담금']] },
  { code: '206', name: '재료비', seomoks: [['01', '재료비']] },
  { code: '207', name: '연구개발비', seomoks: [['01', '연구용역비'], ['02', '전산개발비'], ['03', '시험연구비']] },
  { code: '301', name: '일반보전금', seomoks: [['01', '사회보장적수혜금(국고보조재원)'], ['02', '사회보장적수혜금(취약계층,지방재원)'], ['03', '사회보장적수혜금(지방재원)'], ['04', '장학금 및 학자금'], ['05', '의용소방대지원경비'], ['06', '자율방범대 실비지원'], ['07', '통장 이장 반장 활동보상금'], ['08', '민간인 국외여비'], ['09', '외빈초청여비'], ['10', '사회복무요원보상금'], ['11', '행사실비지원금'], ['12', '예술단원 운동부등보상금'], ['13', '사회성과보상금'], ['14', '기타보상금']] },
  { code: '302', name: '이주 및 재해보상금', seomoks: [['01', '민간인이주보상금'], ['02', '민간인재해및복구활동 보상금']] },
  { code: '303', name: '포상금', seomoks: [['01', '포상금']] },
  { code: '304', name: '연금 부담금 등', seomoks: [['01', '연금부담금'], ['02', '국민건강보험금'], ['03', '의원상해부담금'], ['04', '공무직(무기계약)근로자 보험료부담금 등']] },
  { code: '305', name: '배상금등', seomoks: [['01', '배상금등']] },
  { code: '306', name: '출연금', seomoks: [['01', '출연금']] },
  { code: '307', name: '민간이전', seomoks: [['01', '의료및회복비'], ['02', '민간경상사업보조'], ['03', '민간단체법정운영비보조'], ['04', '민간행사사업보조'], ['05', '민간위탁금'], ['06', '보험금'], ['07', '연금지급금'], ['08', '이차보전금'], ['09', '운수업계보조금'], ['10', '사회복지시설법정운영비 보조'], ['11', '사회복지사업보조'], ['12', '민간인위탁교육비']] },
  { code: '308', name: '자치단체 등 이전', seomoks: [['01', '자치단체경상보조금'], ['02', '징수교부금'], ['03', '자치구조정교부금'], ['04', '시군조정교부금'], ['05', '자치구기타 재원조정비'], ['07', '자치단체간부담금'], ['08', '교육기관에대한보조'], ['09', '지역대학에대한경상보조'], ['10', '시군구 교육비특별회계법정전출금'], ['11', '시군구 교육비특별회계비법정전출금'], ['12', '예비군육성지원경상보조'], ['13', '공기관등에대한경상적위탁사업비'], ['14', '기타부담금']] },
  { code: '309', name: '전출금', seomoks: [['01', '공사공단경상전출금'], ['02', '공무원연금관리공단경상전출금']] },
  { code: '310', name: '국외이전', seomoks: [['01', '국외경상이전'], ['02', '국제부담금']] },
  { code: '311', name: '차입금 이자상환', seomoks: [['01', '시군구지역개발기금차입금이자상환'], ['02', '통화금융기관차입금이자상환'], ['03', '중앙정부차입금이자상환'], ['04', '지방채증권이자상환'], ['05', '기타차입금이자상환']] },
  { code: '401', name: '시설비 및 부대비', seomoks: [['01', '시설비'], ['02', '감리비'], ['03', '시설부대비'], ['04', '행사관련시설비']] },
  { code: '402', name: '민간자본이전', seomoks: [['01', '민간자본사업보조(자체재원)'], ['02', '민간자본사업보조(이전재원)'], ['03', '민간위탁사업비']] },
  { code: '403', name: '자치단체등자본이전', seomoks: [['01', '자치단체자본보조'], ['02', '공기관 등에 대한 자본적 위탁사업비'], ['03', '예비군육성지원자본보조'], ['04', '지역대학에 대한 자본보조']] },
  { code: '404', name: '공사공단자본전출금', seomoks: [['01', '공사공단자본전출금']] },
  { code: '405', name: '자산취득비', seomoks: [['01', '자산및물품취득비'], ['02', '도서구입비']] },
  { code: '406', name: '기타자본이전', seomoks: [['01', '기타자본이전']] },
  { code: '407', name: '국외자본이전', seomoks: [['01', '국외자본이전']] },
  { code: '501', name: '융자금', seomoks: [['01', '민간융자금'], ['02', '통화금융기관 융자금'], ['03', '공사공단등융자금'], ['04', '시군구융자금']] },
  { code: '502', name: '출자금', seomoks: [['01', '출자금']] },
  { code: '601', name: '차입금원금상환', seomoks: [['01', '시군구지역개발기금차입금원금상환'], ['02', '통화금융기관 차입금원금상환'], ['03', '중앙정부 차입금원금상환'], ['04', '지방채증권원금상환'], ['05', '기타 국내차입금원금상환'], ['06', '차관상환'], ['07', '기타 해외채무상환']] },
  { code: '602', name: '예치금', seomoks: [['01', '일반예치금'], ['02', '의무예치금']] },
  { code: '701', name: '기타회계 등 전출금', seomoks: [['01', '기타회계 전출금'], ['02', '공기업특별회계 경상전출금'], ['03', '공기업특별회계 자본전출금']] },
  { code: '702', name: '기금전출금', seomoks: [['01', '기금전출금']] },
  { code: '703', name: '교육비특별회계전출금', seomoks: [['01', '시도법정전출금'], ['02', '시도비법정전출금']] },
  { code: '704', name: '예탁금', seomoks: [['01', '예탁금']] },
  { code: '705', name: '예수금 원리금상환', seomoks: [['01', '예수금원금상환'], ['02', '예수금이자상환'], ['03', '시도지역개발기금예수금원금상환'], ['04', '시도지역개발기금예수금이자상환']] },
  { code: '706', name: '기타내부거래', seomoks: [['01', '감가상각비'], ['02', '당기순이익'], ['03', '적립금']] },
  { code: '801', name: '예비비', seomoks: [['01', '일반예비비'], ['02', '재해재난목적예비비'], ['03', '내부유보금']] },
  { code: '802', name: '반환금기타', seomoks: [['01', '국고보조금반환금'], ['02', '시도비보조금반환금'], ['03', '기타반환금등'], ['04', '잡손금']] },
];
